[
  {
    "firstParagraph": "Yes, we know. The statement above might seem a little bit swollen-headed. Yet it truly is how we feel when we get to play together. The story of ALDA started in January 2018 on a late night at a folk music festival somewhere outside Helsinki, Finland. We had all met and heard each other play before, but never really had the opportunity to play tunes together - until now. It turned into a five-hour wild mayhem of energy, grooves, improvisations, crazy harmonies, and lots and lots of tunes. People came and went, many stayed to listen, and some even joined in the music although somehow the three of us were always at the core of the session. Soon it was morning, and we were still up. Reluctantly we gave in to tiredness and packed down our instruments, just to wake up a couple of hours later to keep playing.",
    "secondParagraph": "ALDA was born in the aftermath of that session. - “We have to do this again!”, we thought to ourselves. So, we started composing and working on music for the combination of saxophone, violin, and piano. The music that we have created is, just as its musicians, deeply rooted in the rich musical traditions of Finland and Sweden, based on traditional types of tunes such as polskas, polkas, schottisches, and waltzes that are brought new meaning by the music of the 21st century. The music borrows inspiration from Celtic music and contains microscopical and macroscopical elements of improvisation. The energy of that first session is ever-present in what we do. Even as a band we regularly get together for sessions to remind ourselves why we fell in love with playing together in the first place.",
    "thirdParagraph": "Recently we had the opportunity to record our first album at the awesome studio of Helsinki Music Centre as part of our work and studies at the Sibelius-Academy, University of the Arts. After many, many months of work our album finally saw the light of day in August 2021. The album can be purchased directly from us, through this website or at local music shops around Helsinki. It will not be available on Spotify in its entirety until a later date."
  }
]